Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Source/Drivers/gd32vw55x_qspi.c
/*!
    \file    gd32vw55x_qspi.c
    \brief   QSPI driver

    \version 2023-07-20, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32vw55x_qspi.h"

/* QSPI register bit offset */
#define CTL_FTL_OFFSET            ((uint32_t)0x00000008U)               /*!< bit offset of FTL in QSPI_CTL */
#define CTL_PSC_OFFSET            ((uint32_t)0x00000018U)               /*!< bit offset of PSC in QSPI_CTL */
#define DCFG_FMSZ_OFFSET          ((uint32_t)0x00000010U)               /*!< bit offset of FMSZ in QSPI_DCFG */
#define TCFG_DUMYC_OFFSET         ((uint32_t)0x00000012U)               /*!< bit offset of DUMYC in QSPI_TCFG */

/* configure QSPI functional mode */
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode);

/*!
    \brief      reset QSPI
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_deinit(void)
{
    rcu_periph_reset_enable(RCU_QSPIRST);
    rcu_periph_reset_disable(RCU_QSPIRST);
}

/*!
    \brief      initialize the parameters of QSPI structure with the default values
    \param[in]  none
    \param[out] init_para: QSPI parameter structure
    \retval     none
*/
void qspi_struct_para_init(qspi_init_struct *init_para)
{
    /* set the QSPI struct with the default values */
    init_para->clock_mode     = QSPI_CLOCK_MODE_0;
    init_para->prescaler      = 3U;
    init_para->fifo_threshold = 16U;
    init_para->sample_shift   = QSPI_SAMPLE_SHIFTING_NONE;
    init_para->flash_size     = 0x1FU;
    init_para->cs_high_time   = QSPI_CS_HIGH_TIME_1_CYCLE;
}

/*!
    \brief      initialize the parameters of QSPI command structure with the default values
    \param[in]  none
    \param[out] init_para: QSPI command parameter structure
    \retval     none
*/
void qspi_cmd_struct_para_init(qspi_command_struct *init_para)
{
    /* set the QSPI command struct with the default values */
    init_para->instruction_mode = QSPI_INSTRUCTION_NONE;
    init_para->instruction      = 0U;
    init_para->addr_mode        = QSPI_ADDR_NONE;
    init_para->addr_size        = QSPI_ADDR_8_BITS;
    init_para->addr             = 0U;
    init_para->altebytes_mode   = QSPI_ALTE_BYTES_NONE;
    init_para->altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
    init_para->altebytes        = 0U;
    init_para->dummycycles      = 0U;
    init_para->data_mode        = QSPI_DATA_NONE;
    init_para->data_length      = 0U;
    init_para->sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
}

/*!
    \brief      initialize the parameters of QSPI read polling structure with the default values
    \param[in]  none
    \param[out] init_para: QSPI read polling parameter structure
    \retval     none
*/
void qspi_polling_struct_para_init(qspi_polling_struct *init_para)
{
    /* set the QSPI read polling struct with the default values */
    init_para->match            = 0U;
    init_para->mask             = 0U;
    init_para->interval         = 0U;
    init_para->statusbytes_size = 1U;
    init_para->match_mode       = QSPI_MATCH_MODE_AND;
    init_para->polling_stop     = QSPI_POLLING_STOP_DISABLE;
}

/*!
    \brief      initialize QSPI
    \param[in]  qspi_struct: QSPI parameter initialization structure
                            and the member values are shown as below:
                  prescaler: between 0 and 255
                  fifo_threshold: between 1 and 16
                  sample_shift: QSPI_SAMPLE_SHIFTING_NONE, QSPI_SAMPLE_SHIFTING_HALFCYCLE, QSPI_SAMPLE_SHIFTING_ONECYCLE
                  flash_size: between 0 and 28
                  cs_high_time: QSPI_CS_HIGH_TIME_1_CYCLE, QSPI_CS_HIGH_TIME_2_CYCLE, QSPI_CS_HIGH_TIME_3_CYCLE,
                                QSPI_CS_HIGH_TIME_4_CYCLE, QSPI_CS_HIGH_TIME_5_CYCLE, QSPI_CS_HIGH_TIME_6_CYCLE,
                                QSPI_CS_HIGH_TIME_7_CYCLE, QSPI_CS_HIGH_TIME_8_CYCLE
                  clock_mode: QSPI_CLOCK_MODE_0, QSPI_CLOCK_MODE_3
    \param[out] none
    \retval     none
*/
void qspi_init(qspi_init_struct *qspi_struct)
{
    /* configure prescaler, sample_shift, fifo_threshold */
    QSPI_CTL &= ~(QSPI_CTL_PSC | QSPI_CTL_SSAMPLE | QSPI_CTL_FTL);
    QSPI_CTL |= (qspi_struct->prescaler << CTL_PSC_OFFSET) | qspi_struct->sample_shift | ((qspi_struct->fifo_threshold - 1U) << CTL_FTL_OFFSET);

    /* configure flash_size, cs_high_time, clock_mode */
    QSPI_DCFG &= ~((QSPI_DCFG_FMSZ) | QSPI_CS_HIGH_TIME_8_CYCLE | QSPI_DCFG_CKMOD);
    QSPI_DCFG |= ((qspi_struct->flash_size << DCFG_FMSZ_OFFSET) | qspi_struct->cs_high_time | qspi_struct->clock_mode);
}

/*!
    \brief      enable QSPI
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_enable(void)
{
    QSPI_CTL |= (uint32_t)QSPI_CTL_QSPIEN;
}

/*!
    \brief      disable QSPI
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_QSPIEN);
}

/*!
    \brief      enable QSPI DMA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_enable(void)
{
    QSPI_CTL |= (uint32_t)(QSPI_CTL_DMAEN);
}

/*!
    \brief      disable QSPI DMA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_DMAEN);
}

/*!
    \brief      configure QSPI command parameters
    \param[in]  cmd: QSPI command parameter structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
*/
void qspi_command_config(qspi_command_struct *cmd)
{
    /* call the configuration function */
    qspi_config(cmd, QSPI_NORMAL_WRITE);

